Re1Wi0.1/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{                
                type             ESTRALog;

                rho              rho [1 -3 0 0 0 0 0] 1.;
                etaS             etaS [1 -1 -1 0 0 0 0] .01;
                etaP             etaP [1 -1 -1 0 0 0 0] .99;             
                lambda           lambda [0 0 1 0 0 0 0] .1;
                L2               L2 [0 0 0 0 0 0 0] 100;
                gamma            gamma [0 0 0 0 0 0 0] 1.; //JUST AN INTIAL VALUE
                tau0             tau0 [1 -1 -2 0 0 0 0] 3.5;
                breakingintervaltest breakingintervaltest [0 0 0 0 0 0 0] 1;
                solveInTau       false; 
               
                stabilization    coupling;              
}

passiveScalarProperties
{
                solvePassiveScalar   no;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
