Re1Wi0.1/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver          GAMG;
        tolerance       1e-12;
        relTol          0;
        smoother        GaussSeidel;
    }
    
    
    "(U|volL2_)"
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-12;
        relTol           0.;
        minIter          0;
        maxIter          5000;
        
    }

    "(theta|tau|C|A)"
    {

        solver           PBiCG;
        preconditioner
        {
            preconditioner DILU;
        }

        tolerance         1e-12;
        relTol            0.;
        minIter           0;
        maxIter           1000;
    }
 
}

 

SIMPLE
{
    nInIter         1;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        
    }
}

relaxationFactors
{
    fields
     {        
	p 	.7;
     }

    equations
     { 
       A        .7;
       U 	.7;
       tau	.7;
       theta 	.7;
       C	.7;
       volL2_   1;
     }
}

// ************************************************************************* //
